DataProcessors/ВыборОбедов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ВыборОбедов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/ОбедыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ОбедыПользователей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Пользователи</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОбеда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОбеда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыОбедов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ВыборОбедов/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаписатьОбед(Команда)
	ЗаписатьОбедНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОбедНаСервере()
	Если НЕ ЗначениеЗаполнено(ДатаОбеда) Тогда
		ДатаОбеда = ТекущаяДата();
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ВариантОбеда) Тогда
		ВариантОбеда = Справочники.ВариантыОбедов.Куритца;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Сообщить("Укажите пользователя");
		Возврат;
	КонецЕсли;	
	НайденныйОбед = Справочники.ОбедыПользователей.НайтиПоРеквизиту("ДатаОбеда",ДатаОбеда,,Пользователь);
	Если ЗначениеЗаполнено(НайденныйОбед) Тогда 
		  ОбъектОбед = НайденныйОбед.ПолучитьОбъект();
	Иначе 
		  ОбъектОбед = Справочники.ОбедыПользователей.СоздатьЭлемент();
		  ОбъектОбед.Владелец = Пользователь;
		  ОбъектОбед.ДатаОбеда = ДатаОбеда; 
	КонецЕсли; 	
	      ОбъектОбед.Наименование = ""+ Пользователь+ " Дата "+ ДатаОбеда;
		  ОбъектОбед.Записать();
КонецПроцедуры
